#include "cSessionManager.h"
#include "cIOCPhandler.h"
cSessionManager::cSessionManager()
{

}
cSessionManager::~cSessionManager()
{

}

//--------------------------------------------------------------------------------------------------------------------------------------
//格  利 : session pool 霖厚
//累己磊 : 捞盔硅
//老  矫 : 2020. 02. 13
//--------------------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------------------

void cSessionManager::MakeSessionObject(int _max_session_count)
{
	for (int i = 0;i < _max_session_count;i++)
	{
		cUser* newsession = new cUser;
		 
		newsession->setKey(i+1);
		newsession->SetReadyAccept();

		mSessionArray[i] = newsession;
		 
	}
	cout << "make session ok" << endl;
}

//--------------------------------------------------------------------------------------------------------------------------------------
//格  利 : 立加 技记 包府
//累己磊 : 捞盔硅
//老  矫 : 2020. 02. 15
//--------------------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------------------

void cSessionManager::InputNewSession(cSession* _session)
{
	PACKET_ACCEPT_ACK sendpacket;
	mCS_SessionManager.LockCS();
	mUsingSessionCount++;
	ShowSessionCount();
	mCS_SessionManager.UnlockCS();

	SOCKET sock = _session->getSock();
	
	SINGLETON(cIOCPhandler).MakeCompletionPort(sock, _session);
	sendpacket.mSafeKey = _session->getKey();

	_session->OnSend(&sendpacket, sendpacket.mPacketSize, 0);
	_session->OnRecv();
 
}
//--------------------------------------------------------------------------------------------------------------------------------------
//格  利 : 立加 技记 惑炔 免仿
//累己磊 : 捞盔硅
//老  矫 : 2020. 02. 15
//--------------------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------------------

void cSessionManager::ShowSessionCount()
{
	printf("[ Session State] = %d / %d \n", mUsingSessionCount, MAX_SESSION_COUNT);
 
}
//--------------------------------------------------------------------------------------------------------------------------------------
//格  利 : 立加 辆丰 技记 包府
//累己磊 : 捞盔硅
//老  矫 : 2020. 02. 15
//--------------------------------------------------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------------------------------------------------
void cSessionManager::OutSession()
{
	mCS_SessionManager.LockCS();

	mUsingSessionCount--;
	ShowSessionCount();

	mCS_SessionManager.UnlockCS();
}